performance_test/FIO/psync/android/core1.log
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
rand_read: Laying out IO file (1 file / 1024MiB)

rand_read: (groupid=0, jobs=1): err= 0: pid=11569: Mon Apr 21 16:20:02 2025
  read: IOPS=3301, BW=12.9MiB/s (13.5MB/s)(645MiB/50001msec)
    clat (usec): min=183, max=14424, avg=297.15, stdev=215.84
     lat (usec): min=183, max=14424, avg=297.72, stdev=215.96
    clat percentiles (usec):
     |  1.00th=[  210],  5.00th=[  219], 10.00th=[  225], 20.00th=[  233],
     | 30.00th=[  239], 40.00th=[  247], 50.00th=[  258], 60.00th=[  269],
     | 70.00th=[  289], 80.00th=[  314], 90.00th=[  363], 95.00th=[  437],
     | 99.00th=[ 1037], 99.50th=[ 1369], 99.90th=[ 2573], 99.95th=[ 3687],
     | 99.99th=[ 8586]
   bw (  KiB/s): min=11280, max=14680, per=100.00%, avg=13222.75, stdev=560.38, samples=99
   iops        : min= 2820, max= 3670, avg=3305.67, stdev=140.10, samples=99
  lat (usec)   : 250=43.85%, 500=52.67%, 750=1.51%, 1000=0.88%
  lat (msec)   : 2=0.87%, 4=0.17%, 10=0.04%, 20=0.01%
  cpu          : usr=0.72%, sys=23.26%, ctx=185389, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=165066,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=12.9MiB/s (13.5MB/s), 12.9MiB/s-12.9MiB/s (13.5MB/s-13.5MB/s), io=645MiB (676MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=164979/191, merge=0/780, ticks=38184/88, in_queue=38283, util=82.94%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=11816: Mon Apr 21 16:20:52 2025
  write: IOPS=4691, BW=18.3MiB/s (19.2MB/s)(916MiB/50001msec); 0 zone resets
    clat (usec): min=102, max=12499, avg=207.20, stdev=183.60
     lat (usec): min=103, max=12500, avg=207.83, stdev=183.70
    clat percentiles (usec):
     |  1.00th=[  135],  5.00th=[  141], 10.00th=[  145], 20.00th=[  153],
     | 30.00th=[  157], 40.00th=[  163], 50.00th=[  169], 60.00th=[  180],
     | 70.00th=[  198], 80.00th=[  225], 90.00th=[  273], 95.00th=[  334],
     | 99.00th=[  906], 99.50th=[ 1237], 99.90th=[ 2245], 99.95th=[ 2835],
     | 99.99th=[ 6587]
   bw (  KiB/s): min=14784, max=21984, per=100.00%, avg=18789.30, stdev=1116.29, samples=99
   iops        : min= 3696, max= 5496, avg=4697.28, stdev=279.10, samples=99
  lat (usec)   : 250=86.41%, 500=11.52%, 750=0.71%, 1000=0.55%
  lat (msec)   : 2=0.66%, 4=0.12%, 10=0.02%, 20=0.01%
  cpu          : usr=1.22%, sys=34.75%, ctx=250530, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,234604,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=18.3MiB/s (19.2MB/s), 18.3MiB/s-18.3MiB/s (19.2MB/s-19.2MB/s), io=916MiB (961MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=163/234406, merge=2/433, ticks=52/33198, in_queue=33271, util=75.71%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=12108: Mon Apr 21 16:21:43 2025
  read: IOPS=3200, BW=12.5MiB/s (13.1MB/s)(625MiB/50001msec)
    clat (usec): min=185, max=16330, avg=306.59, stdev=224.84
     lat (usec): min=185, max=16330, avg=307.13, stdev=224.90
    clat percentiles (usec):
     |  1.00th=[  210],  5.00th=[  219], 10.00th=[  225], 20.00th=[  233],
     | 30.00th=[  239], 40.00th=[  247], 50.00th=[  265], 60.00th=[  289],
     | 70.00th=[  306], 80.00th=[  330], 90.00th=[  383], 95.00th=[  453],
     | 99.00th=[ 1090], 99.50th=[ 1434], 99.90th=[ 2671], 99.95th=[ 3621],
     | 99.99th=[ 8717]
   bw (  KiB/s): min=10176, max=13808, per=100.00%, avg=12818.42, stdev=591.64, samples=99
   iops        : min= 2544, max= 3452, avg=3204.57, stdev=147.94, samples=99
  lat (usec)   : 250=41.92%, 500=54.29%, 750=1.74%, 1000=0.85%
  lat (msec)   : 2=0.99%, 4=0.18%, 10=0.04%, 20=0.01%
  cpu          : usr=0.72%, sys=22.44%, ctx=179059, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=160019,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=12.5MiB/s (13.1MB/s), 12.5MiB/s-12.5MiB/s (13.1MB/s-13.1MB/s), io=625MiB (655MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=159757/188, merge=0/429, ticks=38423/93, in_queue=38523, util=83.53%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=12353: Mon Apr 21 16:22:33 2025
  write: IOPS=4757, BW=18.6MiB/s (19.5MB/s)(929MiB/50001msec); 0 zone resets
    clat (usec): min=103, max=14196, avg=204.43, stdev=180.21
     lat (usec): min=103, max=14197, avg=205.06, stdev=180.28
    clat percentiles (usec):
     |  1.00th=[  135],  5.00th=[  141], 10.00th=[  145], 20.00th=[  151],
     | 30.00th=[  157], 40.00th=[  161], 50.00th=[  167], 60.00th=[  178],
     | 70.00th=[  196], 80.00th=[  223], 90.00th=[  269], 95.00th=[  326],
     | 99.00th=[  832], 99.50th=[ 1172], 99.90th=[ 2245], 99.95th=[ 2933],
     | 99.99th=[ 6652]
   bw (  KiB/s): min=15256, max=21064, per=100.00%, avg=19051.84, stdev=825.77, samples=99
   iops        : min= 3814, max= 5266, avg=4762.94, stdev=206.44, samples=99
  lat (usec)   : 250=87.06%, 500=11.03%, 750=0.70%, 1000=0.47%
  lat (msec)   : 2=0.59%, 4=0.11%, 10=0.03%, 20=0.01%
  cpu          : usr=1.10%, sys=35.03%, ctx=253528, majf=0, minf=6
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,237871,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=18.6MiB/s (19.5MB/s), 18.6MiB/s-18.6MiB/s (19.5MB/s-19.5MB/s), io=929MiB (974MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=0/237616, merge=0/339, ticks=0/33154, in_queue=33183, util=76.61%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_read: (groupid=0, jobs=1): err= 0: pid=12612: Mon Apr 21 16:23:23 2025
  read: IOPS=3024, BW=11.8MiB/s (12.4MB/s)(591MiB/50001msec)
    clat (usec): min=185, max=15684, avg=324.91, stdev=215.37
     lat (usec): min=185, max=15684, avg=325.46, stdev=215.65
    clat percentiles (usec):
     |  1.00th=[  215],  5.00th=[  227], 10.00th=[  235], 20.00th=[  247],
     | 30.00th=[  262], 40.00th=[  269], 50.00th=[  285], 60.00th=[  306],
     | 70.00th=[  326], 80.00th=[  351], 90.00th=[  404], 95.00th=[  478],
     | 99.00th=[ 1139], 99.50th=[ 1483], 99.90th=[ 2769], 99.95th=[ 3490],
     | 99.99th=[ 7373]
   bw (  KiB/s): min= 9744, max=13456, per=100.00%, avg=12114.57, stdev=604.89, samples=99
   iops        : min= 2436, max= 3364, avg=3028.59, stdev=151.22, samples=99
  lat (usec)   : 250=21.63%, 500=74.01%, 750=2.09%, 1000=0.95%
  lat (msec)   : 2=1.06%, 4=0.22%, 10=0.04%, 20=0.01%
  cpu          : usr=0.61%, sys=21.42%, ctx=169513, majf=0, minf=7
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=151221,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=11.8MiB/s (12.4MB/s), 11.8MiB/s-11.8MiB/s (12.4MB/s-12.4MB/s), io=591MiB (619MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=150945/189, merge=0/272, ticks=39007/120, in_queue=39148, util=83.60%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process

rand_wr: (groupid=0, jobs=1): err= 0: pid=12878: Mon Apr 21 16:24:14 2025
  write: IOPS=4726, BW=18.5MiB/s (19.4MB/s)(923MiB/50001msec); 0 zone resets
    clat (usec): min=105, max=13585, avg=205.75, stdev=177.98
     lat (usec): min=106, max=13586, avg=206.35, stdev=178.07
    clat percentiles (usec):
     |  1.00th=[  135],  5.00th=[  141], 10.00th=[  147], 20.00th=[  153],
     | 30.00th=[  157], 40.00th=[  163], 50.00th=[  169], 60.00th=[  180],
     | 70.00th=[  198], 80.00th=[  225], 90.00th=[  269], 95.00th=[  330],
     | 99.00th=[  832], 99.50th=[ 1188], 99.90th=[ 2245], 99.95th=[ 2769],
     | 99.99th=[ 6652]
   bw (  KiB/s): min=14496, max=21184, per=100.00%, avg=18930.74, stdev=844.37, samples=99
   iops        : min= 3624, max= 5296, avg=4732.65, stdev=211.10, samples=99
  lat (usec)   : 250=86.52%, 500=11.61%, 750=0.68%, 1000=0.48%
  lat (msec)   : 2=0.56%, 4=0.13%, 10=0.02%, 20=0.01%
  cpu          : usr=1.19%, sys=35.29%, ctx=253039, majf=0, minf=7
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,236307,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=18.5MiB/s (19.4MB/s), 18.5MiB/s-18.5MiB/s (19.4MB/s-19.4MB/s), io=923MiB (968MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=0/236039, merge=0/460, ticks=0/33057, in_queue=33073, util=75.24%